DROP TABLE IF EXISTS player;

CREATE TABLE player
(
    id             BIGSERIAL,
    name           VARCHAR(12) NULL,
    title          VARCHAR(30) NULL,
    race           VARCHAR(20) NULL,
    profession     VARCHAR(20) NULL,
    birthday       DATE        NULL,
    banned         BOOLEAN     NULL,
    experience     INT         NULL,
    level          INT         NULL,
    untilNextLevel INT         NULL,
    PRIMARY KEY (id)
);

INSERT INTO player(name, title, race, profession, birthday, banned, experience, level, untilNextLevel)
VALUES ('Ниус', 'Приходящий Без Шума', 'HOBBIT', 'ROGUE', '2010-10-12', FALSE, 58347, 33, 1153)
     , ('Никрашш', 'НайтВульф', 'ORC', 'WARLOCK', '2010-02-14', FALSE, 174403, 58, 2597)
     , ('Эззэссэль', 'шипящая', 'DWARF', 'CLERIC', '2006-02-28', TRUE, 804, 3, 196)
     , ('Бэлан', 'Тсе Раа', 'DWARF', 'ROGUE', '2008-02-25', TRUE, 44553, 29, 1947)
     , ('Элеонора', 'Бабушка', 'HUMAN', 'SORCERER', '2006-01-07', TRUE, 63986, 35, 2614)
     , ('Эман', 'Ухастый Летун', 'ELF', 'SORCERER', '2004-06-21', FALSE, 163743, 56, 1557)
     , ('Талан', 'Рожденный в Бронксе', 'GIANT', 'ROGUE', '2005-05-15', FALSE, 68950, 36, 1350)
     , ('Арилан', 'Благотворитель', 'ELF', 'SORCERER', '2006-08-10', FALSE, 61023, 34, 1977)
     , ('Деракт', 'Эльфёнок Красное Ухо', 'ELF', 'ROGUE', '2010-06-22', FALSE, 156630, 55, 2970)
     , ('Архилл', 'Смертоносный', 'GIANT', 'PALADIN', '2005-01-12', FALSE, 76010, 38, 1990)
     , ('Эндарион', 'Маленький эльфенок', 'ELF', 'DRUID', '2001-04-24', FALSE, 103734, 45, 4366)
     , ('Фаэрвин', 'Темный Идеолог', 'HUMAN', 'NAZGUL', '2010-09-06', FALSE, 7903, 12, 1197)
     , ('Харидин', 'Бедуин', 'TROLL', 'WARRIOR', '2009-09-08', FALSE, 114088, 47, 3512)
     , ('Джур', 'БоРец с жАжДой', 'ORC', 'DRUID', '2009-07-14', FALSE, 29573, 23, 427)
     , ('Грон', 'Воин обреченный на бой', 'GIANT', 'PALADIN', '2005-04-28', FALSE, 174414, 58, 2586)
     , ('Морвиел', 'Копье Калимы', 'ELF', 'CLERIC', '2010-03-15', FALSE, 49872, 31, 2928)
     , ('Ннуфис', 'ДиамантоваЯ', 'HUMAN', 'ROGUE', '2001-09-03', FALSE, 162477, 56, 2823)
     , ('Ырх', 'Троль гнет ель', 'TROLL', 'WARRIOR', '2001-04-08', TRUE, 136860, 51, 940)
     , ('Блэйк', 'Серый Воин', 'HUMAN', 'ROGUE', '2005-05-23', FALSE, 151039, 54, 2961)
     , ('Нэсс', 'Бусинка', 'TROLL', 'WARRIOR', '2008-02-09', TRUE, 64945, 35, 1655)
     , ('Ферин', 'Воитель', 'TROLL', 'WARRIOR', '2003-07-08', FALSE, 120006, 48, 2494)
     , ('Солках', 'Ученик Магии', 'ELF', 'SORCERER', '2001-11-07', FALSE, 152996, 54, 1004)
     , ('Сцинк', 'Титан Войны', 'GIANT', 'WARRIOR', '2008-01-04', TRUE, 86585, 41, 3715)
     , ('Айша', 'Искусительница', 'HUMAN', 'CLERIC', '2010-01-25', FALSE, 106181, 45, 1919)
     , ('Тант', 'Черт закAтай вату', 'DWARF', 'PALADIN', '2010-10-03', FALSE, 33889, 25, 1211)
     , ('Трениган', 'Великий Волшебник', 'ELF', 'SORCERER', '2004-05-17', FALSE, 91676, 42, 2924)
     , ('Вуджер', 'Печальный', 'TROLL', 'NAZGUL', '2010-10-04', FALSE, 93079, 42, 1521)
     , ('Камираж', 'БAнкир', 'DWARF', 'CLERIC', '2005-08-05', TRUE, 79884, 39, 2116)
     , ('Ларкин', 'СвЯтой', 'HOBBIT', 'CLERIC', '2003-07-10', FALSE, 111868, 46, 932)
     , ('Зандир', 'Темновидец', 'ELF', 'WARLOCK', '2003-05-24', FALSE, 29654, 23, 346)
     , ('Балгор', 'пещерный Урук', 'ORC', 'NAZGUL', '2005-02-23', FALSE, 18869, 18, 131)
     , ('Регарн', 'Любитель ОЛивье', 'GIANT', 'WARRIOR', '2006-12-23', FALSE, 144878, 53, 3622)
     , ('Анжелли', 'Молодой Боец', 'DWARF', 'WARRIOR', '2010-04-08', FALSE, 59281, 33, 219)
     , ('Джерис', 'Имперский Воин', 'ORC', 'WARRIOR', '2001-05-12', FALSE, 173807, 58, 3193)
     , ('Жэкс', 'Ярочкино Солнышко', 'GIANT', 'WARRIOR', '2008-01-04', FALSE, 848, 3, 152)
     , ('Филуэль', 'Химик и Карпускулярник.', 'ELF', 'WARLOCK', '2008-08-03', FALSE, 48496, 30, 1104)
     , ('Яра', 'Прельстивая', 'HUMAN', 'CLERIC', '2004-06-12', FALSE, 138306, 52, 4794)
     , ('Иллинас', 'Иероглиф', 'HOBBIT', 'WARRIOR', '2007-06-03', FALSE, 115546, 47, 2054)
     , ('Ардонг', 'Вспышк A', 'HUMAN', 'WARLOCK', '2009-09-16', FALSE, 24984, 21, 316)
     , ('Аттирис', 'и.о.Карвандоса', 'ELF', 'SORCERER', '2010-04-15', TRUE, 60520, 34, 2480);